aaron-bond.better-comments
beardedbear.beardedtheme
brandonkirbyson.vscode-animations
danielpinto8zz6.c-cpp-compile-run
esbenp.prettier-vscode
formulahendry.code-runner
github.copilot
github.copilot-chat
github.remotehub
github.vscode-pull-request-github
huibizhang.codesnap-plus
katsute.code-background
miguelsolorio.fluent-icons
miguelsolorio.symbols
ms-ceintl.vscode-language-pack-pt-br
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-vscode.azure-repos
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
ms-vscode.remote-repositories
naumovs.color-highlight
njpwerner.autodocstring
subframe7536.custom-ui-style
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
